SOAPe/Templates/EWS/PullSubscriptionRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Body>
    <m:Subscribe>
      <m:PullSubscriptionRequest xmlns="http://schemas.microsoft.com/exchange/services/2006/messages">
        <t:FolderIds>
          <!--FIELD:Folder;DistinguishedFolderId-->
        </t:FolderIds>
        <t:EventTypes>
          <!--FIELD:Event Type;ElementCheckedList;t:EventType;CreatedEvent,DeletedEvent,ModifiedEvent,CopiedEvent,MovedEvent,NewMailEvent,FreeBusyChangedEvent-->
        </t:EventTypes>
        <t:Timeout>30</t:Timeout>
      </m:PullSubscriptionRequest>
    </m:Subscribe>
  </soap:Body>
</soap:Envelope>